Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་ཐུགས་དུལ་ཡིད་གཉིས་འཇོམས་པ་པོ། །འདམ་ལས་རྒལ་ཅིང་སྐམས་ལ་ཤིན་ཏུ་བཞུགས། །ཐུབ་ཆེན་རྒལ་ཅིང་འགྲོ་བ་སྒྲོལ་མཛད་པ། །ཇི་ལྟར་ཉི་མས་མུན་པ་བསལ་ནས་སུ། །གཟུགས་ཀྱི་རྣམ་པ་སྣང་ཞིང་གསལ་བ་ལྟར། །དེ་བཞིན་སྟོན་པའི་ཐུགས་ནི་རྣམ་གྲོལ་ཞིང་། །སེམས་ཅན་སྡུག་བསྔལ་མང་གནོད་མཐར་མཛད་པ། །མིག་སྦྱིན་གསོ་བའི་དཔྱད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You with calm mind who has conquered doubts, Who has crossed the swamp and reached dry land, And as a great sage crossed over, now liberates beings. Just as the sun dispels the darkness, “Shines on, and illuminates forms, So too does the Guide’s mind, liberated, Put an end to beings’ abundant suffering— I bow to the physician who grants eyesight!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་རབ་ཏུ་གདུང་བྱེད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Pratāpana asked the Blessed One in the form of a song in verse:

source: རྒྱལ་བ་གསེར་མདོག་ཕྲིན་ལས་ཅི་མཛད་ན། །དུས་གསུམ་མཁྱེན་ལ་རབ་ཏུ་བརྟན་པར་བཞུགས། །
en: “Golden Victor, what deeds did you perform That led you to steadfastly penetrate knowledge of the three times?

source: ནམ་མཁའ་ལྟ་བུར་མཁྱེན་ལྡན་ཞུ་བགྱིས་པ། །འགྲོ་བའི་འདྲེན་པས་དེ་དག་བདག་ལ་གསུངས། །
en: I ask you this, you who have space-like wisdom— Guide of beings, please explain this to me.”

source: ཐོགས་མེད་མཁྱེན་པས་ཐུགས་ནི་མ་ཆགས་ཤིང་། །སོམ་ཉི་གཅོད་ལ་ཐེ་ཙོམ་སེལ་མཛད་པ། །རྒྱལ་བ་རང་བྱུང་ཐུགས་ཀྱིས་དེའི་བསམ་པ། །ཤིན་ཏུ་ཐུགས་ཆུད་དེ་ནི་ལུང་བསྟན་པ། །
en: The one with unhindered knowledge, his mind free of attachment, Who had cut through apprehension and eliminated doubt, The self-arisen victor was utterly aware Of his thoughts, and bestowed a reply:

source: རྟག་ཏུ་དགེ་བ་དྲན་ལྡན་སྟེན་བྱེད་ཅིང་། །ངེས་པའི་ལས་བྱས་པས་ནི་བདེ་འབྱུང་དང་། །
en: “Because I always applied myself to remembering virtue, And carried out definite actions, I became happy.

source: རྟག་ཏུ་གཞན་ཡང་ཤེས་ལ་འཇོག་བྱེད་ཅིང་། །བདག་ཉིད་ཇི་ཙམ་ཤེས་པ་སེར་སྣ་མེད། །
en: Moreover, I always led others to understanding. As much as I knew, I shared without greed.

source: མཁས་པ་དེ་ཡིས་ལས་དེ་བྱས་པས་ན། །ལུས་ཞིག་ནས་ནི་གཞན་འཕྲུལ་དག་ཏུ་འགྲོ། །
en: “As I carried out deeds with such expertise, When my body perished, I went to Others’ Emanations.

source: འདོད་པ་དག་ན་སྤྱོད་པའི་ལྷ་གནས་དང་། །ཐུར་དུ་འབབ་ཅིང་མི་ཡི་བར་དུ་འབྱུང་། །
en: I stayed there among the gods who revel in the desire realm Before descending and ending up as a human.

source: དུས་གསུམ་ཤེས་ལ་རྣམ་པར་རྩེ་བྱེད་ཅིང་། །བདག་དང་དེ་བཞིན་གཞན་ཡང་ཤེས་པར་བྱེད། །
en: “I sported in knowledge of the three times, Knowing myself as well as others,

source: པགས་པ་སྲབ་ཅིང་བློ་དང་ལྡན་གྱུར་པ། །
en: And so I gained fine skin and intelligence.”

source: བདེ་གཤེགས་ཐོགས་པ་མེད་པས་ལུང་བསྟན་ཏོ། །
en: Thus did the Blissful One unobstructedly explain.

source: ཤིན་ཏུ་བློ་ལྡན་མཆོག་གིས་བསྟན་ཐོས་ནས། །ཀླུ་ཆེན་རབ་ཏུ་གདུང་བྱེད་དགའ་གྱུར་ཏེ། །
en: The great nāga felt fervent joy As he heard the teaching given by the one with supreme intelligence, And

source: བྱང་ཆུབ་གཞལ་དུ་མེད་ལ་རབ་གནས་ཤིང་། །
en: he became stable in unfathomable awakening.

source: ཡང་དག་བསྔགས་པས་མི་མཆོག་རྒྱལ་བ་བསྟོད། །
en: With genuine tribute, he praised the Victor, the foremost of humans:

source: དུས་གསུམ་མཚན་ཉིད་གཅིག་ཏུ་གཟིགས་མཛད་ཅིང་། །
en: “You perceive the three times as having the same character, And

source: ལས་དང་རྣམ་སྨིན་དེ་བཞིན་རབ་ཏུ་མཁྱེན། །
en: you understand karma and its ripening.

source: སེམས་ཅན་དག་གི་ཁྱད་པར་བདེ་བ་མཁྱེན། །
en: You understand beings’ unique types of happiness.

source: བདེ་གཤེགས་ཐམས་ཅད་གཏོང་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the Blissful One who gave up everything!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་སྟོབས་ཆེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ། །
en: Then the nāga king Bali asked the Blessed One in the form of a song in verse:

source: མི་མཆོག་མཆོག་རབ་མཁྱེན་རབ་མཐའ་ཡས་པ། །མགོན་པོ་རྡུལ་བྲལ་ཐུགས་ནི་ཡོངས་སུ་དག །བདག་གི་སོམ་ཉི་མྱུར་སོལ་ཐེ་ཙོམ་ཡང་། །སྐྱེན་པར་དགུམ་ཕྱིར་བདེ་བར་གཤེགས་པས་གསུངས། །
en: “Foremost of humans, you who have supreme and infinite knowledge, Flawless guardian, your mind utterly pure, In order to quickly dispel my apprehensions and swiftly Slay my doubts, will the Blissful One explain:

source: ཇི་ལྟར་སྔོན་ཚེ་མི་དང་ལྷ་དག་གིས། །སུག་ལས་བགྱིས་པ་བློ་མཁས་ཇི་ལྟར་འཚལ། །ཇི་ལྟར་བླ་མེད་བྱང་ཆུབ་མཆོག་ཐོབ་པ། །
en: “What deeds did you perform in the past as a god and human? How did you gain such knowledge? How did you achieve unsurpassed awakening?

source: བདག་གིས་ཐེ་ཙོམ་ཞུས་པ་མྱུར་བར་གསུངས། །
en: I present you my doubts—please do explain!”

source: སྟོབས་བཅུའི་སྟོབས་མཁྱེན་བདག་ཉིད་ཤིན་ཏུ་ངེས། །རྒྱལ་ལ་ཀླུ་ཡིས་ཞུས་པ་མྱུར་གསུང་སྟེ། །
en: As the nāga asked the Victor, the definite embodiment Of the knowledge of the ten powers, he promptly replied,

source: ང་ཡིས་ཇི་ལྟར་མི་ཡི་སྤྱོད་ཀུན་དང་། །དགེ་བའི་བསམ་པས་བྱང་ཆུབ་ཚོལ་བྱེད་ཅིང་། །
en: “I first thought, ‘How should I engage in human behavior And with a virtuous outlook pursue awakening?

source: ཇི་ལྟར་ཡིད་རབ་དགའ་བས་བསྒྲུབས་པ་དང་། །ཇི་ལྟར་སྐྱེ་དགུ་སྡུག་བསྔལ་གྱིས་གནོད་ཅིང་། །ཐ་མ་མཐོང་ལ་ངན་འགྲོར་ལྟུང་བ་དང་། །ཉོན་མོངས་བརྒྱ་ཡིས་མུན་པར་གྱུར་པ་ཤེས། །
en: “ ‘How can I practice with a joyful mind? How can I understand the way all beings are affected by suffering, And how they end up falling to the lower realms, Blackened by myriad afflictions?’

source: དེར་ནི་སེམས་ཅན་སྙིང་པོས་སྙིང་རྗེ་བསྐྱེད། །
en: “I then developed compassion for sentient beings from the core of my heart,

source: ང་ཡིས་སེམས་ཅན་འདི་དག་སྡུག་བསྔལ་དགྲོལ། །
en: ‘I will free these beings from suffering,

source: ཐར་བར་འགྱུར་བའི་ལམ་མཆོག་དག་ཏུ་བཞག །
en: I will set them on the supreme path to liberation,

source: ང་ཡིས་ངན་འགྲོ་དག་གི་ལམ་ངན་དགག །
en: I will close off the negative paths to the lower realms.

source: ང་ཡིས་ལམ་མཆོག་ཞི་བ་རབ་ཏུ་བསྟན། །བདེ་བའི་ལམ་གྱིས་བྱང་ཆུབ་ཞི་བར་བཀུར། །
en: “ ‘I will teach the peaceful, supreme path, And grant them peaceful awakening via the joyful path.

source: སྟོབས་བཅུའི་ལམ་མཆོག་རབ་ཏུ་བསྟན་བྱ་ཞིང་། །ཡུན་རིང་མི་དག་གིས་ནི་དོན་འགྱུར་བྱ། །
en: I will teach the supreme path of the ten powers, And for a long while I will fulfill people’s aims.’

source: དེ་ལྟར་བརྟན་པ་དེས་ནི་སྙིང་རྗེ་བསྐྱེད། །
en: “Thus did I engender compassion in a steadfast way.

source: དྲང་སྲོང་ཆེན་པོས་དགེ་ཚུལ་བསྒྲུབས་ནས་སུ། །མགོ་དང་མིག་དང་དེ་བཞིན་ཤ་དག་ནི། །བཏང་ནས་བདེ་གཤེགས་ལམ་ནས་དཔའ་བོ་འགྲོ། །
en: Then the Great Sage trained as a novice, Giving away my head, eyes, and flesh, Heroically traversing the path of the blissful ones.

source: སྔོན་གྱི་དུས་སུ་མི་ཡིས་སྤྱད་པ་ནི། །དེ་ཚེ་རྨི་ལམ་ལྟ་བུར་རབ་ཏུ་མཁྱེན། །
en: “When I was practicing as a human in the past, I understood things to be like a dream.

source: དགེ་བ་འདི་དག་མི་ཡིས་ཤེས་པ་ན། །སྟོབས་བཅུ་མངའ་ལ་མཆོད་པ་རྩོལ་བར་བྱེད། །
en: Aware of these virtues as a human, I exerted myself in venerating the one with the ten powers.

source: མགོན་ལ་གཞལ་མེད་དེ་བཞིན་དད་བསྐྱེད་ནས། །ཇི་ལྟར་འགྲོ་ཀུན་མགོན་དུ་བདག་འགྱུར་སྙམ། །
en: “Feeling immeasurable faith in the Guardian, I wondered how I too could become a guardian of all beings.

source: ཇི་ལྟར་སྐྱེ་བོ་ཕོངས་ཚེ་བདག་གིས་ནི། །སྟོབས་བཅུས་བསྟན་པའི་ལམ་ལ་གཞག་པར་བྱ། །
en: How could I lead these destitute beings Onto the path taught by the one with ten powers?

source: དགེ་བའི་རྩ་བ་འདི་དག་བསྟེན་པ་ན། །འདྲེན་པ་དག་གིས་སྤྱད་ལ་རྗེས་སུ་བསླབ། །
en: “With these roots of virtue as a basis, I trained in the deeds carried out by the guides.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མཐའ་ཡས་སུ། །ལམ་གོལ་སོང་བ་རྣམས་ལ་ལམ་མཆོག་བསྟན། །
en: Over one quintillion eons I taught the supreme path to those who were lost.

source: འདི་ལྟར་བདག་ཉིད་ཆེན་པོའི་སྤྱད་སྤྱོད་ན། །མི་ཡིས་སྔོན་གྱི་ཕྲིན་ལས་བྱས་པ་མཐོང་། །
en: “Training thus in the practices of great beings, I perceived my past actions as a human.

source: རྨི་ལམ་ལྟ་བུར་བྱས་པར་རྣམ་རིག་ཅིང་། །དེ་ནི་དྲན་ལ་ཕ་རོལ་དག་ལའང་སྟོན། །
en: Aware that actions are performed like in a dream, I kept that in mind and also taught it to others.”

source: སྟོབས་བཅུ་མངའ་བའི་བཀའ་ནི་ཐོས་ནས་སུ། །སྟོབས་ཆེན་ཀླུ་ནི་ཡིད་དགའ་མགུ་གྱུར་ནས། །
en: When he heard the words of the one with ten powers, The mighty nāga was delighted.

source: སོར་བཅུའི་ཐལ་མོ་སྤྱི་བོར་སྦྱར་བཏུད་དེ། །བྱང་ཆུབ་ཞི་ཐོབ་བྱ་ཕྱིར་རྒྱལ་བ་བསྟོད། །
en: Bringing together his ten fingers at his crown, he bowed down And praised the Victor in order to achieve peaceful awakening:

source: རྣམ་པར་འདྲེན་ལ་བདག་གིས་དད་བསྐྱེད་པས། །སྟོབས་བཅུའི་མཛད་པ་དག་ནི་བདག་གིས་བགྱི། །
en: “Arousing faith in the Guide, I will perform the activities of the ten powers!

source: སྐྱེ་བོ་ལམ་གོལ་འགྲོ་ཞིང་མུན་གྱུར་རྣམས། །བྱང་ཆུབ་ཞི་བ་ཐོབ་པར་བདག་གིས་བགྱི། །
en: I will make it so that beings who are lost And in the darkness reach peaceful awakening.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་སྤྲིན་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ། །
en: Then the nāga king Mahāmegha asked the Blessed One in the form of a song in verse:

source: སྟོབས་བཅུ་མངའ་བ་སྐྱེ་བོ་ཡོངས་གྲོལ་མཛད། །འདྲེན་པ་རང་བྱུང་ལ་ནི་བདག་འདི་ཞུ། །
en: “You with ten powers who liberates beings, Self-arisen Guide, I ask you this:

source: ཇི་ལྟར་སྟོན་པའི་སྲས་ཀྱིས་བརྩོན་བསྐྱེད་ན། །ཞི་བ་རྡུལ་མེད་བྱང་ཆུབ་མཆོག་འཐོབ་འགྱུར། །
en: How should a child of the Teacher strive To reach peaceful, flawless, supreme awakening?”

source: ཇི་ལྟར་འབད་པའི་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་སུ། །བླ་མེད་བྱང་ཆུབ་བྱང་ཆུབ་སེམས་འཐོབ་པ། །ཡོན་ཏན་དཔག་མེད་ཡེ་ཤེས་མཆོག་མངའ་བའི། །དྲང་སྲོང་ཆེན་པོས་སྲས་ཞུས་ལུང་བསྟན་པ། །
en: The Great Sage who has limitless qualities And supreme wisdom, then explained to his son How a bodhisattva achieves unexcelled awakening Through the power of effortful diligence:

source: བྱང་ཆུབ་དོན་དུ་ང་ཡིས་སྔོན་སྤྱད་པ། །ཇི་ལྟར་འགྲོ་བ་རྣམས་སུ་སྟོབས་བརྩོན་བསྟེན། །བརྩོན་འགྲུས་སྟོབས་ཀྱི་བྱང་ཆུབ་ངས་བརྙེས་པ། །དེ་ནི་ང་ཡིས་ཅུང་ཟད་བཤད་པར་བྱ། །
en: “Let me describe briefly how in the past, When I was practicing for awakening, I applied diligent force for the sake of beings And through the force of diligence reached awakening.

source: འདས་པའི་དུས་སུ་མི་བདག་བྱུང་བ་ནི། །མི་ཡི་དབང་ཕྱུག་མི་དབང་སྟོབས་འཆང་ཞེས། །
en: “In the past when I was a human, The lord of the human world was named King Power Holder.

source: རིན་ཆེན་བདུན་ཡོད་བུ་དང་ལྡན་པ་སྟེ། །བདག་ལས་སྐྱེས་པ་ཁྲི་ཕྲག་བརྒྱ་དག་བྱུང་། །
en: He had the seven precious things, and children Numbering one million who were his offspring.

source: དེ་ཚེ་འཇིག་རྟེན་ཁམས་འདི་འང་རྒྱས་པ་སྟེ། །
en: “At that time this world was flourishing, And

source: རི་བོང་བདག་ཅེས་སངས་རྒྱས་ཞིང་དག་བྱུང་། །
en: there was a buddhafield called Lord of Rabbits,

source: དེར་ནི་མི་མཆོག་རང་བྱུང་བྱུང་གྱུར་པ། །རིན་ཆེན་དཔལ་ཞེས་འཇིག་རྟེན་སྒྲ་རྣམས་གྲགས། །
en: In which there was a self-manifest supreme human Whose name, Glorious Jewel, was known throughout the world.

source: མི་མཆོག་དེ་ཡིས་ཉན་ཐོས་དགེ་འདུན་ནི། །ས་ཡ་ཕྲག་ནི་བརྒྱད་ཅུ་དག་བྱུང་ངོ་། །
en: “The supreme human’s community of hearers Numbered eighty million.

source: བདེ་གཤེགས་མཆོག་གི་རྗེས་སྐྱེས་སྲས་ཚོགས་ནི། །ཉོན་མོངས་ཁྲོ་དང་ང་རྒྱལ་འཆབ་བྲལ་བའི། །དེ་ཚེ་མི་མཆོག་དེ་ཡི་བྱང་ཆུབ་སེམས། །ས་ཡ་ཕྲག་ནི་བརྒྱད་ཅུ་དག་བྱུང་སྟེ
en: The supreme Blissful One’s descendent followers Were free of afflictions such as hatred and arrogance. “The supreme human’s bodhisattvas Then also numbered eighty million.

source: རྒྱལ་བ་དཔག་མེད་དག་ལ་སྤྱད་ལྡན་ཞིང་། །འགྲོ་ལ་ཕན་ཕྱིར་བྱང་ཆུབ་འཐོབ་འགྱུར་རོ། །
en: They had practiced with unfathomably many victors And were to attain awakening for the sake of beings.

source: དེ་ན་རྣམ་པར་འདྲེན་པ་དེ་ཡི་ནི། །བྱང་ཆུབ་སེམས་དཔའ་བདུད་བསྟེན་ཞེས་བྱ་བྱུང་། །
en: “One of the Guide’s bodhisattvas Was named User of Evil.

source: དྲང་སྲོང་ཆེན་པོ་བདུད་སྟོབས་རབ་འཇོམས་པ། །དེ་ཡིས་ཚོགས་ཀྱི་གཙོ་བོ་དེ་བྱེད་དོ། །
en: He was a great sage who conquered the force of evil And served as chief of the community.

source: དེ་ནས་བདུད་སྟོབས་བསྙེན་པར་དཀའ་ཞེས་པ། །ལྷའི་བུ་བྱུང་ནས་
en: “At that time there was also a god Named Obstinate Force of Evil,

source: འདྲེན་པ་རྒྱལ་བའི་མཆོག །དེ་ནི་བྱང་ཆུབ་མཆོག་ཏུ་གཤེགས་པ་ལ། །ཇི་ལྟར་མི་རེག་བྱ་ཕྱིར་བར་ཆད་བྱེད། །
en: who made obstacles For the Guide and foremost Victor when he was about to Attain supreme awakening, so that he would not reach it.

source: ས་འདི་རྒྱ་མཚོར་བཅས་པ་ཡོན་ཏན་ལྡན། །དེ་དག་བུད་མེད་ཚོགས་ཀྱིས་མངོན་སྤྲུལ་ཏེ། །བཟང་མོ་ཡོན་ཏན་རབ་མཆོག་འཛིན་པས་བཀང་། །
en: “Throughout the whole earth with all its qualities, Including the oceans, he manifested many women— Fine, replete with sublime qualities,

source: དགའ་བའི་ཚིག་དང་ཡིད་འོང་ཚིག་སྨྲ་ཞིང་། །
en: They spoke in a charming and beautiful way.

source: མིག་ནི་བཟང་ལ་འགྲོས་ཀྱང་ལྡེམ་བག་ཅན། །
en: “They had gorgeous eyes and walked in a lithe and careful way.

source: གླང་པོའི་སྣ་ལྟར་ལག་མཉམ་པ་ཡི་མདོག །
en: Their arms were even, the color of an elephant’s trunk.

source: ཡུན་རིང་དག་ཏུ་བརྟུལ་ཞུགས་འཛིན་པ་སྟེ། །
en: For a long time they had upheld religious conduct.

source: ནུ་མ་སྲ་ལ་ལེགས་དང་ལྡན་པ་ཡིན། །
en: Their breasts were firm and lovely.

source: ངག་ཚིག་སྙན་ཅིང་པད་མ་འདྲ་བའི་མིག །
en: “Their voices were sweet, their eyes like lotus flowers,

source: སོ་ཡི་ཕྲེང་བ་ཐགས་དམ་འཆང་བ་སྟེ། །
en: Their teeth were lined in marvelous rows,

source: བྱི་རུའི་མདོག་ལྟར་མཆུ་ནི་མཛེས་པ་ཡིན། །
en: Their lips were gorgeous, the color of coral,

source: བཞིན་དང་འགྲམ་པ་དག་ནི་མཛེས་དང་ལྡན། །
en: Their faces and cheeks were beautiful.

source: བཞིན་གྱི་མདོག་ནི་ཟླ་བ་དྲི་མེད་འཕྲོག །
en: “The color of their faces was stolen from the flawless moon;

source: འཛུམ་ཞིང་ཚིག་ནི་སྙན་པ་གཏོང་བ་སྟེ། །
en: They smiled and uttered pretty words.

source: གླང་མཆོག་མྱོས་པ་ལྟ་བུར་མཛེས་པའི་འགྲོས། །
en: Their way of walking was beautiful, like supreme elephants in rut.

source: ངོ་ཚ་ཤེས་པས་བློ་གྲོས་ངན་པ་སྤངས། །
en: They were modest and had forsaken foolishness.

source: ནུ་མ་སྲ་ཞིང་ཚིགས་ཀྱིས་ཟིན་པ་སྟེ། །
en: “With firm breasts and lithe limbs

source: རྒྱལ་པོ་ལྟ་བུར་དེའི་ལུས་འཆང་། །བཟང་མོའི་ལུས་ངོས་སྲབ་ཅིང་འཇམ་དང་ལྡན། །རྒྱལ་པོའི་བྱིན་འདྲ་རྩེ་འགྲོ་ཞིང་། །རྐང་པ་མཉམ་ལ་འཇོལ་བའི་ཐབས་སུ་འགྲོ། །འདོད་ཆགས་ལྡང་བར་འགྱུར་བའི་བུ་མོ་དག །
en: Their bodies were like those of the antelope king, Excellent bodies, slender and smooth, And led others like the king of antelopes. “They had flat feet that slid as they walked, These tantalizing maidens.

source: བདུད་ཀྱིས་ས་རྣམས་ཐམས་ཅད་གང་བྱས་པ། །དམར་བ་ཟུང་དུ་ལྡན་པའི་མྱོས་མ་སྟེ། །བདུད་ཀྱིས་བདུད་ཀྱི་ཞགས་པ་མདུན་དུ་བསྟན། །
en: Whatever Māra did anywhere, Accompanied by these crimson damsels, “Māra would be in front displaying his evil noose.

source: དེ་ཡི་འདོད་པ་བདུད་སྟོབས་ཐམས་ཅད་དག །དེ་ཚེ་བསྐྱེད་ནས་བདུད་བསྟེན་འཇིགས་བྱས་ཀྱང་། །ནག་པོའི་རྩ་ལག་དེ་ཡིས་གཙེ་མ་ནུས། །བར་ཆད་བྱ་བར་རབ་ཏུ་མ་ཚུགས་སོ། །
en: While Obstinate Force of Evil created these temptations, Attempting to frighten User of Evil, The kinsmen of darkness could not affect “Or create obstacles for him.

source: དེ་ནས་ཤིན་ཏུ་མི་བཟད་སྲིན་པོ་ནི། །བྱེ་བ་དག་གིས་ཚིག་རྩུབ་སྨྲ་བར་བྱེད། །
en: Then ten million terrifying rākṣasas Verbally abused him,

source: དཔག་ཏུ་མེད་ཅིང་བསམ་ཡས་མུ་མེད་པའི། །ལུས་བོང་མཐའ་ཡས་མངོན་སྤྲུལ་ཚིག་རྩུབ་སྨྲ། །
en: As countless, incredibly innumerable emanations “With bodies of infinite proportions reviled him:

source: མདུང་ཐུང་མདའ་བོ་ཆེ་ཡིས་རྒྱོབ་ཤིག་རྒྱོབ། །
en: ‘Shoot him with spears and lances!’

source: འདི་ཡི་མྱུར་དུ་རི་ཡིས་ཆོམ། །
en: ‘Quick—smash his brains under a mountain!’

source: འདི་ཡི་སྙིང་ལ་གཟི་བརྗིད་ཡོད་པ་ཕྲོགས། །
en: ‘Steal the life force right from his heart!’

source: མྱུར་དུ་དུས་ལས་འདའ་ཞིང་འགོག་པར་གྱིས། །ཐང་ཅིག་ཙམ་ཡང་འདི་ནི་སྲོག་མ་སྦྱིན། །
en: “ ‘We will soon make you pass on and decease!’ ‘We will not let you live a moment longer!’

source: ཇི་ལྟར་འདོད་པའི་ཡོན་ཏན་དེ་བསྟེན་ན། །བདག་གི་རྒྱལ་སྲིད་གནོད་པ་མེད་པར་འགྱུར། །
en: ‘Once you savor these sensual delights, You will not harm our dominion!

source: ང་ཡི་ཡང་དག་ཚིག་དེ་ཐོས་ནས་སུ། །རྒྱལ་བའི་བསྟན་པ་འཕེལ་བར་མ་བྱེད་ཅིག །
en: “ ‘Hear our honest words And do not spread the Victor’s teachings!’

source: དེ་ཚེ་བོང་བུའི་རྣམ་པ་མངོན་སྤྲུལ་པ། །མགོ་གཅིག་པ་དང་མགོ་གཉིས་པ་དག་བྱུང་། །
en: Then magically emanated donkeys appeared, Some with one head and some with two,

source: སྲིན་པོ་རྣམས་ནི་སྒྲ་བོ་ཆེ་དག་འབོད། །
en: “And rākṣasas howling blaringly.

source: ལ་ལ་མདུང་དང་མདའ་བོ་ཆེ་དག་ཐོགས། །
en: Some were holding spears and lances,

source: ལ་ལ་དག་ཀྱང་རི་ནི་ཁྱེར་བ་སྟེ། །
en: Some carrying mountains, And

source: ལ་ལ་སྡང་བའི་སེམས་ཀྱིས་སྤྲུལ་འཛིན་ཅིང་། །
en: others irately brandishing snakes.

source: དེ་ཡི་མདུན་དུ་ཤིན་ཏུ་སྒྲ་དག་འབྱིན། །
en: “They all made loud noises in front of him.

source: དེ་ཚེ་ལ་ལ་གནོད་སྦྱིན་མངོན་སྤྲུལ་ཏེ། །ལུས་གཅིག་པ་དང་ལུས་གཉིས་ལག་པ་ནི། །གསུམ་དག་ཡོད་ཅིང་ལུས་བཞི་ལག་པ་གཅིག །
en: Some manifested in the form of yakṣas, With single or double bodies and three arms, Or quadruple bodies with one arm.

source: དེ་ཚེ་ལུས་གཅིག་མངོན་པར་སྤྲུལ་བྱས་ཤིང་། །དེ་ཚེ་དེ་བཞིན་མགོ་བཞི་མངོན་པར་སྤྲུལ། །
en: “Then some manifested with one body, Then some manifested with four heads,

source: དེ་ནས་ལུས་གཅིག་མངོན་པར་སྤྲུལ་བྱས་ཏེ། །དེ་དག་བོང་བུ་ར་དང་བྱི་ལ་དང་། །སྟག་གི་གདོང་སྟེ་འཇིགས་པར་བྱེད་པ་དག །སོ་སོ་མི་འདྲ་བ་ཡི་སྐད་དག་འབྱིན། །
en: Then some manifested with single bodies, Terrifying , with faces “Of donkeys, goats, cats, and tigers, Each making its own sound.

source: བོང་བུའི་གདོང་ནི་ར་ཡི་སྐད་འབྱིན་ཅིང་། །
en: The donkey heads bleated like goats;

source: ར་ཡི་གདོང་ནི་བོང་བུའི་སྐད་འབྱིན་ལ། །
en: The goat heads brayed like donkeys,

source: བོང་བུ་གླང་པོའི་སྐད་དང་རྟ་སྐད་འབྱིན། །
en: “Some goats roared like elephants or neighed like horses.

source: བོང་བུ་གཅིག་གི་ཁ་ནས་སྐད་ཀུན་འབྱིན། །
en: Certain donkeys made all sorts of sounds.

source: དེ་ཚེ་ར་ཡི་ཁ་ནས་ཐམས་ཅད་སྐད། །
en: Some goats made all types of sounds as well;

source: ཤིན་ཏུ་འཇིགས་སྐད་དཔག་ཏུ་མེད་པ་འབྱིན། །
en: Countless terrifying sounds were cried.

source: གཞན་ཡང་བདེ་གཤེགས་བསྙེན་པར་བྱ་བའི་ཕྱིར། །གླང་པོ་ཁ་ནས་ཚིག་རྩུབ་དཔག་མེད་འབྱིན། །
en: “Then in an attempt to approach the Blissful One, Elephant heads shouted countless insults,

source: དེ་ཚེ་གླང་པོ་བོང་བུའི་སྐད་འབྱིན་ཅིང་། །དེ་བཞིན་རྟ་དང་དེ་བཞིན་གླང་པོ་དག །རྣམ་པ་མཐའ་ཡས་སྐད་དག་འབྱིན་བྱེད་ཀྱང་། །བདེ་གཤེགས་བ་སྤུའི་ཁུང་བུ་འང་མ་གཡོས་སོ། །
en: While other elephants made donkey sounds, As did horses and elephants. “Although they made a plethora of sounds, Not a pore on the Blissful One’s body moved.

source: རྟ་ནི་གླང་པོའི་སྐད་དག་འབྱིན་བྱེད་ཅིང་། །དེ་བཞིན་སྤྲེའུ་ནི་རྟ་ཡི་སྐད་དག་འབྱིན། །
en: Horses roared like elephants, And monkeys neighed like horses.

source: སྤྲེའུའི་ཁ་ནས་མཐའ་ཡས་སྐད་འབྱིན་ཀྱང་། །བདེ་གཤེགས་བ་སྤུའི་ཁུང་ཡང་གཡོས་མ་གྱུར། །
en: “Although monkeys made countless sounds, Not a pore on the Blissful One’s body flinched.

source: རྒྱལ་པོ་ཝ་ཡི་སྐད་འབྱིན་ཅིང་། །བོང་བུའི་ཕྱུགས་དང་བྱ་བྱི་རྟ་སྐད་འབྱིན། །
en: Lions barked like foxes, Donkeys mooed, and birds neighed.

source: དེ་ཚེ་རྣམ་འདྲེན་གཙེ་བར་མ་ནུས་ཤིང་། །བ་སྤུའི་ཁུང་བུའང་གཡོས་པར་མ་གྱུར་ཏོ། །
en: “But they could not affect the Guide, Or even make a pore on his body flinch.

source: དེ་ཚེ་སྟག་ནི་ཕག་གི་སྐད་འབྱིན་ཅིང་། །དེ་ཚེ་ཕྱུགས་དང་བྱ་ནི་སྦྲུལ་སྐད་འབྱིན། །
en: Then tigers squealed like pigs, And cows and birds hissed like snakes.

source: རྣམ་འདྲེན་དེ་ནི་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱ་བ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: “But they could not affect the Guide, Or even make any disturbance for him.

source: ཁྱུ་མཆོག་སེང་གེའི་སྐད་འབྱིན་ཅིང་། །བྱི་ལ་ཝ་ནི་ཕག་གི་སྐད་འབྱིན་ལ། །
en: Bulls roared like lions; Cats and foxes squealed like pigs.

source: མ་ཧེ་དག་ནི་སྟག་གི་སྐད་འབྱིན་ཀྱང་། །འཇིག་རྟེན་མཁས་པ་བར་ཆད་བྱ་མ་ནུས། །
en: “And although buffaloes growled like tigers, They could not disturb the Knower of the World.

source: དེ་བཞིན་ཕྱུགས་ཀྱི་ཁ་ནས་མཐའ་ཡས་པ། །རྣམ་པ་བྱེ་བ་སེམས་ཅན་སྐད་འབྱིན་ཀྱང་། །རྣམ་འདྲེན་དེ་ནི་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱ་བ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: Cows made tens of millions of infinite Sounds of different animals. “Yet they could not affect the Guide, Or even create any disturbance for him.

source: སྟག་ནི་ཁྱུ་མཆོག་སྐད་འབྱིན་ཅིང་། །དེ་བཞིན་བོང་བུའི་སྐད་དང་རྟ་ཡི་སྐད། །
en: Tigers lowed like bulls, Brayed like donkeys, and neighed like horses.

source: དེ་ཚེ་དོམ་ནི་སེང་གེའི་སྐད་འབྱིན་ཀྱང་། །འཇིག་རྟེན་ཕན་མཛད་བ་སྤུའི་ཁུང་མ་གཡོས། །
en: “Although bears roared like lions, Not even a pore on the Benefiter of the World flinched.

source: དྲེད་ནི་ནམ་མཁའ་ལྡིང་གི་སྐད་འབྱིན་ཅིང་། །དེ་ཚེ་དེ་བཞིན་གླང་པོ་རྟ་སྐད་འབྱིན། །
en: Hyenas cried like garuḍas, While elephants neighed like horses.

source: ནམ་མཁའ་ལྡིང་ནི་ཁུ་བྱུག་སྐད་འབྱིན་ཅིང་། །དེ་བཞིན་ནེ་ཙོ་ཕྱུགས་བཞོན་སྐད་འབྱིན་ལ། །ནེ་ཙོའི་སྐད་ནི་ཡང་དག་སྐད་འབྱིན་བྱེད། །
en: Garuḍas cooed like cuckoos, While certain parrots bawled like calves, “And others made real parrot calls.

source: ཤང་ཤང་ཏེའུའི་སྐད་རྣམས་འབྱིན་པར་བྱེད། །
en: Jīvaṃjīvaka birds sang their songs,

source: དེ་ཚེ་ཀ་ལ་པིང་ཀའི་ཡང་དག་སྐད། །
en: Kalaviṇka birds made their own cries—

source: དེ་ཚེ་མཚན་མོ་གང་ལ་ཞེ་སའི་སྐད། །
en: In the darkness of night came words of deference.

source: དེ་ཚེ་ཉམས་སུ་དགའ་བ་རྨ་བྱའི་སྐད། །དེ་བཞིན་ཙན་ཙའི་སྐད་དང་ཤུགས་ཀྱི་སྐད། །
en: “Lovely peacock calls were heard, As were the cries of Cañcā.

source: ཕྱུགས་བཞོན་ཞེ་སའི་སྐད་དག་འབྱིན་པར་བྱེད། །
en: Calves spoke in tones of reverence, And

source: དེ་ཚེ་ཀ་ལ་པིང་ཀ་ཡིད་འོང་དགའ། །
en: kalaviṇka birds made lovely calls.

source: ཀོ་ཀའི་ཚིག་རྩུབ་དག་ནི་འབྱིན་བྱེད་ཀྱང་། །རྒྱལ་བའི་ཐུགས་ནི་གཞན་དུ་མ་གྱུར་ཏོ། །
en: “Wolves howled their harsh cries— Still, the Victor’s mind was not distracted.

source: སྦྲུལ་ནི་གླང་པོའི་སྐད་དག་འབྱིན་བྱེད་ཅིང་། །དེ་བཞིན་གླང་པོ་སྦྲུལ་གྱི་སྐད་འབྱིན་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱ་བ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: Snakes roared like elephants, And elephants hissed like snakes. “And yet they could not affect the Guide, Or even cause him any disturbance.

source: དེ་ཚེ་ངང་པ་སེང་གེའི་སྐད་འབྱིན་ཅིང་། །དེ་བཞིན་ཁྱིམ་བྱ་ཁྲ་ཡི་སྐད་འབྱིན་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱ་བ་དག་ཏུ་འང་མ་ཚུགས་སོ། །
en: Geese roared like lions, Chickens screamed like hawks, “But they could not affect the Guide, Or even cause him a disturbance.

source: རྟ་ནི་དྲེའུ་ཡི་སྐད་དག་འབྱིན་བྱེད་ཅིང་། །དེ་བཞིན་ཙན་ཙ་གོ་བོའི་སྐད་འབྱིན་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱ་བ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: Horses brayed like mules, And Cañcā made the sounds of eagles. “But they could not affect the Guide, Or even cause him any disturbance.

source: གླང་པོ་འུག་པ་ཙན་ཙའི་སྐད་འབྱིན་ཅིང་། །བྱ་དང་ཁྱུ་མཆོག་སྐད་འབྱིན་ཁྲུང་ཁྲུང་སྐད། །
en: Elephants shrieked like owls, called like Cañcā, And made sounds of birds, bulls, and storks.

source: དེ་ཚེ་བྱ་རྒོད་འཛིམྷའི་སྐད་འབྱིན་ཅིང་། །བྱ་དང་ཁྱུ་མཆོག་བྷེ་རིའི་སྐད་འབྱིན་ལ། །
en: “Vultures cried like jṛmbha birds, Birds and bulls made sounds of kettle drums,

source: ངང་པའི་ཁ་ནས་སྐད་རྣམས་ཐམས་ཅད་འབྱིན། །དེ་བཞིན་ཁུ་བྱུག་གནོད་སྦྱིན་ཀུན་གྱི་སྐད། །
en: Geese made all types of sounds, Cuckoos made all different sounds of yakṣas.

source: དེ་ཚེ་གྲུལ་བུམ་ཐམས་ཅད་སྐད་འབྱིན་ཅིང་། །དེ་བཞིན་ཁ་གཅིག་ནས་ནི་སྐད་ཀུན་འབྱིན། །
en: “Kumbhāṇḍas made all sorts of sounds. Certain beings made all types of sounds with a single mouth.

source: ཁ་ཡི་རྣམ་པ་དེ་ལས་དེ་སྐད་འབྱིན། །སྐད་ཅིག་ཏུ་ནི་མཐའ་ཡས་སྐད་འབྱིན་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱེད་པ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: They made the respective sounds with a single mouth, In a single instant making infinite sounds. “But they could not affect the Guide, Or even cause him a disturbance.

source: ཀླུ་ཡི་ཁ་ནས་རྡོ་ཡི་ཆར་འབེབས་ཤིང་། །དེ་བཞིན་མཚོན་ཆ་དྲག་པོའི་ཆར་འབེབས་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱེད་པ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: Nāgas let down a rain of stones from their mouths And a fierce shower of weapons, “But they could not affect the Guide, Or even cause him any disturbance.

source: གནོད་སྦྱིན་ཁ་ནས་རྡོ་ཡི་ཆར་འབེབས་ཤིང་། །དེ་བཞིན་མེ་རབ་འབར་བའི་ཆར་འབེབས་ལ། །དེ་བཞིན་རི་དང་ཕྱག་དར་ཆར་འབེབས་ཀྱང་། །བདེ་གཤེགས་བར་ཆད་བྱ་བར་མ་ནུས་སོ། །
en: Yakṣas rained down stones from their mouths As well as a blazing shower of fire “And a rain of mountains and dust, But they could not disturb the Blissful One.

source: གྲུལ་བུམ་མདའ་ཡི་ཆར་དང་དེ་བཞིན་དུ། །མེ་འབར་དང་ནི་མཚོན་ཆའི་ཆར་འབེབས་ཀྱང་། །རྣམ་འདྲེན་དེ་ལ་གཙེ་བར་མ་ནུས་ཤིང་། །བར་ཆད་བྱེད་པ་དག་ཏུའང་མ་ཚུགས་སོ། །
en: Kumbhāṇḍas rained down arrows, And showers of blazing flames and weapons. “But they could not affect the Guide, Or even cause him any disturbance.
